# CatOS-type package
author = 'aGrIK'
mode = '='
deps = 'None'
identificator = 'mc'
command_ru = 'мц'
description = 'мц бля лучник'
#hide
wtfaye = [
"мц", "зига", "бля", "бля", "бля", "лучник", "рим", "3", "майнкрафт", "вартандер", "фолыч", "хуй", "окси", "децл", "смегма", "ауе", "катвеирд", "арсех", "куранин", "антивирус", "смоук", "это", "вон там",
"пасик", "джул", "бруско", "каста", "драг", "аегис", "айджаст", # вейпы и прочая хуйня
"вагина", "сперма", "член", "секс", # секс
"явел", "лезвие"
]
ret = ""
for ayea in range(randd.randint(3, 10)):
    ret += randd.choice(wtfaye) + " "
message(ret)
