# CatOS-type package
author = "catwared"
mode = "="
deps = 'None'
identificator = 'diagnoz'
command_ru = 'диагноз'
description = 'Твой диагноз'

s1 = ['аутизм', 'рак', 'инсульт', 'несварение', 'инфаркт', 'артроз', 'остеохондроз', 'коронавирус', 'перелом', 'ушиб', 'спид', 'вич', 'сифилис', 'вывих', 'перелом', "спермотоксикоз", "гангрена", "ожог", "обморожение", "обморок", "шиза", "паркинсончик", "конъюнктивит", "психоз", "понос", "отсутствие", "раздвоение", randd.choice("биполярное,анальное".split(",")) + " расстройство", "запор", "мастурбация", "смерть", "семяизвержение", "лишение", "депрессия"]
s2 = ['жопы', 'зубов', 'головы', 'мошонки', 'ротовой полости', 'языка', 'глотки', 'печени', 'полости носа', 'трахеи', 'лёгких', 'почек', 'шейки бедра', "члена", "пизды", "мозга", "личности", "очка", "девственности", "целки"]
s3 = ['с осложнениями', 'со смещением осколков', 'первой стадии', 'второй стадии', 'третьей стадии', 'четвёртой стадии', 'твоей мамки']
diag = randd.choice(s1) + ' ' + randd.choice(s2) + ' ' + randd.choice(s3)
message('👨‍⚕ Твой диагноз: ' + diag, reply=True)
